#### Current Property

---

|  |
| --- |
| MacroModuleIterator Class   See Also |

Gets the item at the current position of the iterator.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Macro Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Macro 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Macro^ Current { 	Macro^ get (); } ``` |

#### Implements

 IEnumerator T Current

# Remarks

There is no current item if the iterator has not started yet or has been done.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | There is no current item in the iterator. |

# See Also

MacroModuleIterator Class

Autodesk.Revit.DB.Macros Namespace